# 1. Merging data

In [10]:
import pandas as pd
import numpy as np

d = pd.read_csv('data/Student_Weight_Status_Category_Reporting_Results__Beginning_2010.csv')

d.head()

,LOCATION CODE,COUNTY,AREA NAME,REGION,SCHOOL YEARS,NO. OVERWEIGHT,PCT OVERWEIGHT,NO. OBESE,PCT OBESE,NO. OVERWEIGHT OR OBESE,PCT OVERWEIGHT OR OBESE,GRADE LEVEL,AREA TYPE,STREET ADDRESS,CITY,STATE,ZIP CODE,Location 1
0,0,STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),2010-2012,77813.0,16.2,84578.0,17.6,162391.0,33.7,DISTRICT TOTAL,STATEWIDE (EXCLUDING NYC),NaN,NaN,NaN,NaN,NaN
1,0,STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),2010-2012,44970.0,15.8,48843.0,17.2,93813.0,33.0,ELEMENTARY,STATEWIDE (EXCLUDING NYC),NaN,NaN,NaN,NaN,NaN
2,0,STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),2010-2012,33004.0,16.8,35719.0,18.2,68723.0,35.0,MIDDLE/HIGH,STATEWIDE (EXCLUDING NYC),NaN,NaN,NaN,NaN,NaN
3,0,STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),2012-2014,83095.0,16.7,86016.0,17.3,169111.0,33.9,DISTRICT TOTAL,STATEWIDE (EXCLUDING NYC),NaN,NaN,NaN,NaN,NaN
4,0,STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),STATEWIDE (EXCLUDING NYC),2012-2014,47868.0,16.4,49140.0,16.8,97008.0,33.1,ELEMENTARY,STATEWIDE (EXCLUDING NYC),NaN,NaN,NaN,NaN,NaN

In [14]:
p1 = d[['AREA NAME', 'GRADE LEVEL']][0:2]
p2 = d[['AREA NAME', 'GRADE LEVEL']][2:5]
pd.concat([p1,p2])

                   AREA NAME     GRADE LEVEL
0  STATEWIDE (EXCLUDING NYC)  DISTRICT TOTAL
1  STATEWIDE (EXCLUDING NYC)      ELEMENTARY
2  STATEWIDE (EXCLUDING NYC)     MIDDLE/HIGH
3  STATEWIDE (EXCLUDING NYC)  DISTRICT TOTAL
4  STATEWIDE (EXCLUDING NYC)      ELEMENTARY

In [17]:
concatenated = pd.concat([p1,p2], keys = ['p1','p2'])
concatenated

                      AREA NAME     GRADE LEVEL
p1 0  STATEWIDE (EXCLUDING NYC)  DISTRICT TOTAL
   1  STATEWIDE (EXCLUDING NYC)      ELEMENTARY
p2 2  STATEWIDE (EXCLUDING NYC)     MIDDLE/HIGH
   3  STATEWIDE (EXCLUDING NYC)  DISTRICT TOTAL
   4  STATEWIDE (EXCLUDING NYC)      ELEMENTARY

In [19]:
concatenated.loc['p1']

                   AREA NAME     GRADE LEVEL
0  STATEWIDE (EXCLUDING NYC)  DISTRICT TOTAL
1  STATEWIDE (EXCLUDING NYC)      ELEMENTARY

# 2. Data operations

In [24]:
data = d[d['GRADE LEVEL'] == 'ELEMENTARY']
data['NO. OBESE'].mean()

275.78676207513416

In [25]:
data['NO. OBESE'].sum()

770824.0

In [26]:
data['NO. OBESE'].max()

49140.0

In [27]:
data['NO. OBESE'].min()

5.0

In [28]:
data['NO. OBESE'].std()

2021.1248151905831

In [29]:
data = df[(d['GRADE LEVEL'] == 'ELEMENTARY') & (d['COUNTY'] == 'DELAWARE')]
data['COUNTY'].count()

52

# 3. Joins

In [32]:
grade_lookup = {'GRADE LEVEL': pd.Series(['ELEMENTARY','MIDDLE/HIGH', 'MISC']),'LEVEL': pd.Series([1, 2, 3])}
grade_lookup = pd.DataFrame(grade_lookup)
grade_lookup

   GRADE LEVEL  LEVEL
0   ELEMENTARY      1
1  MIDDLE/HIGH      2
2         MISC      3

In [33]:
df[['GRADE LEVEL']][0:5]

      GRADE LEVEL
0  DISTRICT TOTAL
1      ELEMENTARY
2     MIDDLE/HIGH
3  DISTRICT TOTAL
4      ELEMENTARY

### 3.1 The inner join

In [34]:
d_sub = df[0:5].join(grade_lookup.set_index(['GRADE LEVEL']),on=['GRADE LEVEL'], how='inner')
d_sub[['GRADE LEVEL', 'LEVEL']]

   GRADE LEVEL  LEVEL
1   ELEMENTARY      1
4   ELEMENTARY      1
2  MIDDLE/HIGH      2

### 3.2 Left outer join

In [35]:
d_sub = df[0:5].join(grade_lookup.set_index(['GRADE LEVEL']),on=['GRADE LEVEL'], how='left')
d_sub[['GRADE LEVEL', 'LEVEL']]

      GRADE LEVEL  LEVEL
0  DISTRICT TOTAL    NaN
1      ELEMENTARY    1.0
2     MIDDLE/HIGH    2.0
3  DISTRICT TOTAL    NaN
4      ELEMENTARY    1.0

### 3.3 Full outer join

In [36]:
d_sub = df[0:5].join(grade_lookup.set_index(['GRADE LEVEL']),on=['GRADE LEVEL'], how='outer')
d_sub[['GRADE LEVEL', 'LEVEL']]

      GRADE LEVEL  LEVEL
0  DISTRICT TOTAL    NaN
3  DISTRICT TOTAL    NaN
1      ELEMENTARY    1.0
4      ELEMENTARY    1.0
2     MIDDLE/HIGH    2.0
4            MISC    3.0

### 3.4 The groupby function

In [38]:
df['NO. OBESE'].groupby(d['GRADE LEVEL']).count()

GRADE LEVEL
DISTRICT TOTAL    2870
ELEMENTARY        2795
MIDDLE/HIGH       2687
Name: NO. OBESE, dtype: int64

In [44]:
d['NO. OBESE'].groupby(d['GRADE LEVEL']).aggregate(sum)

GRADE LEVEL
DISTRICT TOTAL    1359576.0
ELEMENTARY         770824.0
MIDDLE/HIGH        577812.0
Name: NO. OBESE, dtype: float64

In [45]:
df['NO. OBESE'].groupby(d['GRADE LEVEL']).aggregate(['sum', 'mean','std'])

                      sum        mean          std
GRADE LEVEL
DISTRICT TOTAL  1359576.0  473.719861  3502.973168
ELEMENTARY       770824.0  275.786762  2021.124815
MIDDLE/HIGH      577812.0  215.039821  1532.055998